#include <blex/blexlib.h>


#include "docfile.h"
#include "unicode.h"
#include "docfile_impl.h"

/*
OLE file format documentation was found at: http://snake.cs.tu-berlin.de:8081/~schwartz/pmh/index.html
and will be mirrored in X:/webhare/fileformats. The extended fat code is not
documented there, is not documented anywhere on the web as far as I know, and
I haven't gotten around to document it very well here.

A viewer for OLE files can be found on the MSDN PLATFORM SD CDs
(you need the 'Tools', 'Platform SDK tools' - it's called DocFile viewer)

Basically, when the above documented links-to-fat pages are full (after about
7MB of data), a chained list of pages with links-to-fats is scattered throughout
the document. Each of these pages contains 127 block numbers of FAT pages, and
then the block number in to the next page in the extended FAT chain.

A major consideration when reading OLE documents: tolerate errors as much as
possible. It seems that a lot of errors easily sneak into generated OLE docs,
but MS' code often ignores these errors. So, to accept at least as much documents
as MS does, we must attempt to tolerate errors as much as possible. For example,
we don't freak out at some illegal data in the FAT if it is never referenced
anyway.

Note that word 2000 seems to do a fairly good job of checking whether an OLE
document is corrupted, but word 97 often happily reads in a corrupted document,
and crashes later on.


                        throw DocfileException( "I/O error reading a directory block");
                dirdata += (i%EntriesPerBlock);
                pps[i]=*dirdata;
        }

        //Find the root directory
        unsigned root_entry;
        for (root_entry=0; root_entry<max_num_entries; ++root_entry)
          if (pps[root_entry].IsRoot())
            break;

        if (root_entry >= max_num_entries)
           throw DocfileException( "Cannot find the OLE root directory");

        std::vector<bool> touched(max_num_entries,false);

        ProcessDir(NULL,root_entry,pps,touched);
        if (root.get()==NULL)
           throw DocfileException( "Cannot find the OLE root directory");
}

void Docfile::Data::TryPreprocessFile()
{
        if (sourcefile.DirectRead(0,oleheader,sizeof oleheader) != sizeof oleheader
            || !IsDocfileSignature(oleheader))
            throw DocfileException( "File is not an OLE document");

        // check if we actually know this format
        if (getu16lsb(oleheader+0x1c) != 0xFFFE)
            throw DocfileException( "OLE document uses an unsupported byte ordering");
        if (gets16lsb(oleheader+0x1e) != 9)
            throw DocfileException( "OLE document uses an unsupported large sector size");
        if (gets16lsb(oleheader+0x20) != 6)
            throw DocfileException( "OLE document uses an unsupported small sector size");
        if (gets16lsb(oleheader+0x38) != 0x1000)
            throw DocfileException( "OLE document uses an unsupported small stream maximum size");

        int32_t num_bigblock_depots = gets32lsb(oleheader+0x2c);

        if (num_bigblock_depots <= 0)
            throw DocfileException( "No big block depots");

        bigfat.reset(new DocfileDetail::BigFat(*this,num_bigblock_depots));
        smallfat.reset(new DocfileDetail::SmallFat(*bigfat));
        TryReadDirectories();
        smallfat->LoadFat(root->entry.firstblock,root->entry.size);
}

void Docfile::Data::DumpOleFile (std::ostream &output)
{
        output << "OLE Header:\n";
        output << "Number of big block depots: " << gets32lsb(oleheader+0x2C) << '\n';
        output << "Root starting block: " << gets32lsb(oleheader+0x30) << '\n';
        output << "SBD starting block: " << gets32lsb(oleheader+0x3C) << '\n';
//        output << "File contains " << smallfat.fat.size() << " small blocks and " << bigfat.fat.size() << " big blocks\n";

        //for (unsigned a=0;a<getu32lsb(header+0x2C) && a<109;++a)
        //    Debug::Msg("Start block of bbd #%d: %ld",a,(signed long)gets32lsb(header+0x4C+4*a));

        if (getu32lsb(oleheader+0x2c)>=109)
            output << "Additional big block depots are spread throughout their file, but their position has not been recorded\n";

        root->Dump(output,"OLE root",0);
}

//-----------------------------------------------------------------------------
//
// OLE archive functions
//
//
Docfile::Docfile(Blex::RandomStream &infile)
: data(new Data(infile))
{
}

Docfile::~Docfile()
{
        delete data;
}

/*
        struct ole_header
            {
                uint8_t      signature[8];           //0000 D0 CF 11 E0 A1 B1 1A E1
                uint32_t     unused_1[9];            //0008
                LSBS32  num_of_bbd_blocks;      //002C
                LSBS32  root_startblock;        //0030
                uint32_t     unused_2[2];            //0034
                LSBS32  sbd_startblock;         //003C
                uint32_t     unused_3[3];            //0040
                44: first extended fat block
                48: number of extended fat blocks
                LSBS32  bbd_list[109];          //004C
            };
        struct ole_header OLE_HEADER;
*/
bool Docfile::IsDocfileSignature(const uint8_t sig[])
{
        return getu32lsb(sig) == 0xE011CFD0 && getu32lsb(sig+4) == 0xE11AB1A1;
}

RandomStream* Docfile::OpenOleFile(const File *file)
{
        if (!file)
            throw std::logic_error("Docfile::OpenOleFile: Passing NULL pointer as file argument");

        if (file->entry.size < 0x1000)
            return new DocfileDetail::ShortStream(*data,*file);
        else
            return new DocfileDetail::LongStream(*data,*file);
}


Docfile::Directory const * Docfile::GetRoot () const
{
        return data->root.get();
}

std::ostream& operator<<(std::ostream &str, Blex::Docfile const &arc)
{
        arc.data->DumpOleFile(str);
        return str;
}

StreamOwningDocfile::StreamOwningDocfile(Blex::RandomStream *adopt_infile)
: Docfile(*adopt_infile)
, adoptedfile(adopt_infile)
{

}

StreamOwningDocfile::~StreamOwningDocfile()
{
}

///////////////////////////////////////////////////////////////////////////////
//
// OLE property set parser
OlePropertySet::OlePropertySet()
{
}

OlePropertySet::~OlePropertySet()
{
}

bool OlePropertySet::ParseProperties(Blex::Stream &str)
{
        std::vector<uint8_t> propdata;
        ReadStreamIntoVector(str,&propdata);

        if (propdata.size() < 0x30)
            return false; //not a proper file

        /*
        typedef struct PROPERTYSETHEADER
        {
             // Header
             WORD    wByteOrder      // 0x00: Always 0xFFFE
             WORD    wFormat;        // 0x02: Always 0
             DWORD   dwOSVer;        // 0x04: System version
             CLSID   clsid;          // 0x08: Application CLSID
             DWORD   dwReserved;     // 0x18: Should be 1 (Actually, this appears to be the # of sections
        } PROPERTYSETHEADER;
        */
        is_little_endian = Blex::getu16lsb(&propdata[0]) == 0xFFFE;
        if (!is_little_endian && Blex::getu16msb(&propdata[0]) != 0xFFFE)
            return false; //not a proper file (invalid property set indicator)

        if (Blex::getu16lsb(&propdata[2]) != 0)
            return false; //unrecognized format

        unsigned numsections = Blex::getu32lsb(&propdata[0x18]);
        if (0x1C + (numsections * (16+4)) > propdata.size())
            return false; //not a proper file (not enough headers for the specified # of sections)

        //Analyze the sections
        sections.resize(numsections);
        for (unsigned i=0;i<sections.size();++i)
        {
                unsigned start_section_info = 0x1C + i * (16+4);
                memcpy(sections[i].format_id, &propdata[start_section_info], 16);
